tests/data/CN_testData.json

{
  "status": {
    "Approved": "Approved",
    "PendingApproval": "Pending Approval",
    "PartialApproved": "Partial Approved",
    "PendingRelease": "Pending Release",
    "PendingVerification": "Pending Verification",
    "PartialCompleted": "Partial Completed",
    "Received": "Received",
    "Completed": "Completed",
    "Saved": "Saved",
    "Submitted": "Submitted",
    "BankRejected": "Bank Rejected",
    "Rejected": "Rejected",
    "Failed": "Failed",
    "Cancelled": "Cancelled",
    "Active": "Active"
  },
  "paymentType": {
    "CN_TT": "CN - Telegraphic Transfer",
    "CN_CNAPS": "CN - Domestic Transfer",
    "CN_IBPSBulk": "CN - IBPS Bulk Payment"
  },
  "ACT": {
    "UAT": {
      "loginCompanyId": "CNP2A01",
      "loginUserId": "CNP2A01S01"
    },
    "SIT": {
      "loginCompanyId": "SPCN08",
      "loginUserId": "SPCN08V06"
    },
    "country": "CHINA",
    "fromAccount": "30001591488",
    "amount": "20,000",
    "amountA": "10",
    "newPayeeName": "ACTNewPayeeNam·e",
    "newPayeeAdd1": "newPayeeAdd1",
    "newPayeeAdd2": "newPayeeAdd2",
    "newPayeeAdd3": "newPayeeAdd3",
    "newPayeeAcctNumber": "1234567890",
    "paymentDetail": "PaymentDetails",
    "emailIdO": "Email0@dbs.com",
    "emailId1": "Email1@dbs.com",
    "emailId2": "Email2@dbs.com",
    "emailId3": "Email3@dbs.com",
    "emailId4": "Email4@dbs.com",
    "message": "message",
    "transactionNote": "transactionNote",
    "paymentType": "China Account Transfer",
    "existingPayee": "AutoTestACTPayee",
    "idrPaymentCcy": "IDR"
  },
  "CNAPSPayment": {
    "UAT": {
      "loginCompanyId": "CNP2A01",
      "loginSCId": "CNP2A09",
      "loginLMTId": "CNLMT001",
      "loginUserId": "CNP2A01S01",
      "loginHQUserId":"CNP2A01AUTO02",
      "loginLMTUserId": "CNLMT001S01",
      "loginlimitUserId":"CNP2A01AUTO03",
      "verifyUserId": "CNP2A01S03",
      "payeeBankID": " 989584028102"
    },
    "SIT": {
      "loginCompanyId": "SPCN08",
      "loginHQId": "CNP2A01",
      "loginSCId": "CNP2A09",
      "loginLMTId": "CNLMT001",
      "loginUserId": "SPCN08V07",
      "loginHQUserId":"CNP2A01AUTO02",
      "loginLMTUserId": "CNLMT001S01",
      "loginlimitUserId":"CNP2A01AUTO03",
      "verifyUserId": "SPCN08V08",
      "payeeBankID": "969581001287"
    },
    "Country": "CHINA",
    "fromAccount": "77788999333",
    "fromlimitAccount": "20250915001",
    "fromSCAccount": "5411210009163119",
    "existingHQPayee": "CNAPSPayeeForAutoTest",
    "existingSCPayee": "CNAPSPayeeForSCAutoTest",
    "paymentCurrency": "CNY",
    "Limitamount1":"100",
    "Limitamount2":"1",
    "amountA1": "10",
    "amountA2": "1,500",
    "amountV": "3,500",
    "editAmount": "100",
    "existingPayee": "CNAPSPayeeForAutoTest",
    "newPayeeName": "CNAPSNewPayeeName",
    "newPayeeAdd1": "newPayeeAdd1",
    "newPayeeAdd2": "newPayeeAdd2",
    "newPayeeAdd3": "newPayeeAdd3",
    "newPayeeAcctNumber": "1234567890",
    "category": "BAU TEST HQ 1",
    "paymentDetail": "PaymentDetails",
    "emailIdO": "Email0@dbs.com",
    "emailId1": "Email1@dbs.com",
    "emailId2": "Email2@dbs.com",
    "emailId3": "Email3@dbs.com",
    "emailId4": "Email4@dbs.com",
    "message": "message",
    "faxAreaCode0": "000",
    "faxNo0": "76786778",
    "limitMessage":"The transfer amount has exceeded the daily RMB limit of 100.00 set by your company. Please update the settings.",
    "transactionNote": "transactionNote",
    "messageToOrderingBank": "messageToOrderingBank",
    "WithoutChllengeText": "Enter this Challenge to your Digital Token or Security Device",
    "mChllengeText": "you are receiving the Challenge by SMS because you are trying to approve a transaction that you have created",
    "existingTemplateName": "AutoTestCNAPSTemplate",
    "paymentType": "China CNAPS Payment",
    "challengeResponse": "123456",
    "deliveryMethod": "Urgent",
    "payeeBankName": "(澳门地区)汇业银行有限公司",
    "payeeBankCountry": "CHN",
    "PayeeBankID": "969581001287",
    "payeeBankCode": "969"
  },
  "TelegraphicTransfer": {
    "loginCompanyId": "CNP2A01",
    "loginUserId": "DBSAUTOCN01",
    "verifyUserId": "DBSAUTOCN02",
    "fromAccount": "2019073000001",
    "fromAccountID": "2024081603",
    "payeeBankID": "AONEHKH0XXX",
    "paymentCurrency": "SGD",
    "payeeCurrency": "CNY",
    "amountA1": "10",
    "amountA2": "1500",
    "amountV": "3500",
    "editAmount": "100",
    "BOP1Amount": "5",
    "BOP2Amount": "5",
    "DocumentType": "Customs form",
    "fxRef0": "FxReference0",
    "fxAmount0": "10",
    "existingPayee": "AutoTestTTPayee",
    "existingPayeeAcct": "30001599688",
    "Country": "Hong Kong",
    "newPayeeName": "CNTTNewPayeeName",
    "newPayeeNickName": "CNTTNewPayeeNickName",
    "newPayeeAdd1": "newPayeeAdd1",
    "newPayeeAdd2": "newPayeeAdd2",
    "newPayeeAdd3": "newPayeeAdd3",
    "newPayeeRoutingCode": "1234567",
    "newPayeeAcctNumber": "123456000001",
    "paymentType": "China Telegraphic Transfer",
    "intermediaryLocation": "AFGHANISTAN",
    "intermediaryBankID": "ALFHAFK0XXX",
    "paymentDetail": "PaymentDetails",
    "payeeBankName": "A ONE INVESTMENT COMPANY LIMITED",
    "payeeBankLocation": "MALAYSIA",
    "payeeBankAdd1": "MALAHON CENTRE",
    "payeeBankAdd2": "FLOOR 20",
    "payeeBankCity": "HONG KONG",
    "PayeeBankID": "AONEHKH0XXX",
    "intermediaryBankName": "AFGAN UNITED BANK",
    "emailId0": "Email0@dbs.com",
    "emailId1": "Email1@dbs.com",
    "emailId2": "Email2@dbs.com",
    "emailId3": "Email3@dbs.com",
    "emailId4": "Email4@dbs.com",
    "message": "message",
    "bankChargeTypeOUR": "OUR",
    "bankChargeTypeSHARED": "SHARED",
    "bankChargeTypeTHEY": "THEY",
    "faxCountryCode0": "65",
    "faxAreaCode0": "000",
    "faxNo0": "76786778",
    "transactionNote": "transactionNote",
    "messageToOrderingBank": "messageToOrderingBank",
    "pMChllengeText": "you are receiving the Challenge by SMS because you are the 1st approver",
    "mChllengeText": "you are receiving the Challenge by SMS because you are trying to approve a transaction that you have created",
    "challengeResponse": "123456",
    "existingTemplateName": "AUTO TT TEMPLATE",
    "counterptycntryCode": "ANDORRA",
    "specPmtPurpose": "Advance Payment",
    "isTaxFreeGoodsValue": "Yes",
    "specPmtPurposeValue2": "货到付款 Payment Against Delivery",
    "fxAppRefNum": "Fx Bureau Approval Reference Number Form No Busin ",
    "pmtBOPCategory1": "Trade Related - 贸易项下",
    "BOPseriesCode1": "121010 - 一般贸易",
    "pmtBOPCategory1Value2": "Capital - 资本项下",
    "BOPseriesCode1Value2": "521010 - 债务减免",
    "pmtBOPCategory2Value1": "Capital - 资本项下",
    "BOPseriesCode2Value1": "521990 - 其它资本转移",
    "contractNum": "Contract Number 1234",
    "invoiceNum": "Invoice Number Invoice Number 12345",
    "transRemark1": "Transaction Remark 1 Transaction Remark 1 ABCDEFGH",
    "advPmtAmt": "12345",
    "propContractAmt": "100",
    "expectedDeclDays": "100",
    "transactionType": "服务贸易 Trade in Service",
    "certifApprNum": "Certificate of Approval No 12345",
    "pmtNature": "保税区",
    "declareCustoms": "已报关 Declared Customs",
    "customsDeclCcy": "CNY-人民币",
    "tradeType": "一般贸易 General Trade",
    "remarks": "this is used for auto test case this is used for auto test case this is used for auto test case this is used for auto test case ",
    "digidoc": {
      "paymentCurrency": "CNY",
      "BOPseriesCode1": "121010 - 一般贸易",
      "uploadFileName": "DIGI_DOC.pdf",
      "ITT": {
        "dateFrom": "01 Mar 2020",
        "dateTo": "31 Jul 2021",
        "newBOPpaymentCategory1": "Trade Related - 货物贸易",
        "newBOPseriesCode1": "121020 - 进料加工贸易"
      }
    }
  },
  "OnlineRoll_Comment": "----------------------OnlineRoll no support UAT-----------------------",
  "OnlineRoll": {
    "SIT": {
      "loginCompanyId": "CNP2A01",
      "loginUserId": "CNP2A01S01",
      "accountName": "2019073000001",
      "reasonDetail": "reason for AutoTest",
      "statementStartDate": "01 Feb 2019",
      "statementToDate": "01 Oct 2019"
    },
    "Status_PendingReview": "Pending Review",
    "Status_PendingConfirmationApproval": "Pending Confirmation Approval",
    "Status_PendingDeclineApproval": "Pending Decline Approval"
  },
  "CrossBorder": {
    "UAT": {
      "loginCompanyId": "CNAPI01",
      "loginUserId": "CNITRUSR3",
      "fromAccount": "200031183",
      "existingFilterValue": "234590001"
    },
    "SIT": {
      "loginCompanyId": "SPCN08",
      "loginUserId": "SPCN08V06",
      "fromAccount": "30001593288",
      "existingFilterValue": "PayeeName"
    },
    "paymentCountry": "AFGHANISTAN",
    "debitType": "Itemized Debit",
    "amount": "1",
    "purposePaymentLine": "Purpose Payment Line11",
    "counterPartyCode": "ANDORRA",
    "specPmtPurpose": "预付款 Advance Payment",
    "pmtCategory1": "Trade Related - 贸易项下",
    "seriesCode1": "121010 - 一般贸易",
    "cnttTransRemark1": "Transaction Remark1111",
    "fileName": "DIGI_DOC.pdf",
    "paymentDetailLine": "Payment Detail Line111",
    "cROATIACtry": "CROATIA",
    "newPayeeName": "newPayeeName",
    "newPayeeAdd1": "newPayeeAdd1",
    "newPayeeAdd2": "newPayeeAdd2",
    "newPayeeAdd3": "newPayeeAdd3",
    "payeeBankId": "ASBZHR20XXX",
    "newPayeeRoutingCode": "1234567",
    "newPayeeAcctNo": "232323",
    "paymentDetail": "Payment details to the payee bank",
    "Email1": "Email1@111.COM",
    "Email2": "Email2@222.COM",
    "Email3": "Email3@333.COM",
    "Email4": "Email4@444.COM",
    "Email5": "Email5@555.COM",
    "Message": "AutoTestMessage",
    "EUR": "EUR"
  },
  "CallDeposit": {
    "UAT": {
      "loginCompanyId": "CNAPI01",
      "loginUserId": "CNITRUSR3",
      "fundingAccount": "200013082"
    },
    "SIT": {
      "loginCompanyId": "SPCN08",
      "loginUserId": "SPCN08V01",
      "fundingAccount": "300015912"
    },
    "amount": "500,000",
    "amountEdit": "500,001",
    "rejectReason": "reason For Rejection",
    "maturityValue": "Do Not Renew",
    "maturityValue1": "Renew Principal Only",
    "challengeResponse": "12345678",
    "depositType": "Call Deposit"
  },
  "PaymentLimit": {
    "UAT": {
      "loginCompanyId": "CNAPI01",
      "loginUserId": "CNITRUSR3",
      "fundingAccount": "200013082"
    },
    "SIT": {
      "loginCompanyId": "SPCN08",
      "loginUserId": "SPCN08V01",
      "fundingAccount": "30001591488"
    },
    "limitAmount": "1000",
    "challengeResponse": "12345678",
    "existingPayee": "CNPayroll01",
    "amountA1": "1200",
    "errorMessage": "'Transaction exceeds IDEAL transaction daily limit for the company - 1021421 for 18 Aug 2020. Please submit your payment over the counter or update your company limit.'"
  },
  "IBPSBulkPayment": {
    "UAT": {
      "loginCompanyId": "CNP2A01",
      "loginUserId": "CNP2A01S01",
      "verifyUserId": "CNP2A01S03",
      "fromAccount": "200031183",
      "fileName": ""
    },
    "SIT": {
      "loginCompanyId": "AUTOCN01",
      "loginUserId": "AUTOCN01S03",
      "verifyUserId": "AUTOCN01S04",
      "fromAccount": "8888888888",
      "fileName": ""
    },
    "amountA1": "10",
    "amountA2": "1,100",
    "amountA2IX": "1100",
    "amountV": "3,100",
    "amountVIX": "3100",
    "editamount": "20",
    "payeeRef": "payeeRef",
    "existingPayee": "AUTO-Test-IBPSBulk-ExistingPayee",
    "newPayeeName": "IBPSBulkNewPaye·e",
    "payeeNickName": "IBPSBulkNewPaye·e",
    "payeeBankName": "中国人民银行",
    "payeeBankID": "001110002715",
    "newPayeeAcctNumber": "11112222",
    "newPayeeAcctNumberEdit": "1234567890",
    "newPayeeNameEdit": "IBPSBulkNewPayee·Edit",
    "paymentDetails": "Payment details to the payee bank",
    "emailIdO": "Email0@dbs.com",
    "emailId1": "Email1@dbs.com",
    "emailId2": "Email2@dbs.com",
    "emailId3": "Email3@dbs.com",
    "emailId4": "Email4@dbs.com",
    "message": "message",
    "existingTemplate": "AUTOIBPSBulkTemplate",
    "challengeResponse": "123123",
    "referenceForPayee": "payee Reference",
    "rejectReason": "reason For Rejection",
    "labelNoInformationDisplay": "No information to display",
    "fileFormat": "Universal File Format",
    "approvalOptionByTxn": "By Transaction",
    "downloadFileType": "All - UFF",
    "fromDate": "01 Jan 2021",
    "paymentType": "China IBPS Bulk Payment",
    "transactionCodeValue": "22 - Salary Credit"
  },
  "IBPSPayment": {
    "UAT": {
      "loginCompanyId": "CNP2A01",
      "loginUserId": "CNP2A01S01",
      "verifyUserId": "CNP2A01S03",
      "payeeBankID": " 989584028102"
    },
    "SIT": {
      "loginCompanyId": "SPCN08",
      "loginUserId": "SPCN08V01",
      "verifyUserId": "SPCN08V02",
      "payeeBankID": "001110002715"
    },
    "Country": "CHINA",
    "fromAccount": "30001591488",
    "paymentCurrency": "CNY",
    "amountA1": "10",
    "editAmount": "100",
    "existingPayee": "CNAPSPayeeForAutoTest",
    "newPayeeName": "IBPSNewPayeeName",
    "newPayeeAdd1": "newPayeeAdd1",
    "newPayeeAdd2": "newPayeeAdd2",
    "newPayeeAdd3": "newPayeeAdd3",
    "newPayeeAcctNumber": "1234567890",
    "paymentDetail": "PaymentDetails",
    "transactionNote": "transactionNote",
    "payeeBankName": "中国人民银行",
    "payeeBankCountry": "CHN",
    "PayeeBankID": "001110002715",
    "payeeBankCode": "001",
    "paymentType": "China IBPS Payment"
  },
  "CNLimitOrder": {
    "UAT": {
      "loginCompanyId": "CNP2A01",
      "loginUserId": "CNP2A01S01",
      "loginUserIdWithoutApproveOwn": "CNP2A01AUTO1",
      "sellAccountValue": "30001604788",
      "buyAccountValue": "30001605688"
    },
    "SIT": {
      "loginCompanyId": "CNP2A01",
      "loginUserId": "CNP2A01S88",
      "loginUserIdWithoutApproveOwn": "CNP2A01AUTO1",
      "sellAccountValue": "30001604788",
      "buyAccountValue": "30001605688"
    },
    "amountA1": "100",
    "buyAmount": "93.92",
    "sellAccountCCY": "HKD",
    "buyAccountCCY": "CNY",
    "pmtCategory1": "Trade Related - 贸易项下",
    "seriesCode1": "121010 - 一般贸易",
    "remarks": "remarks for Limit Order",
    "responseCode": "123123",
    "rejectReason": "reason For Rejection"
  },
  "InstantFXConversion": {
    "UAT": {
      "loginCompanyId": "CNP2A01",
      "loginUserId": "CNP2A01S01",
      "loginUserIdWithoutApproveOwn": "CNP2A01AUTO1",
      "fromAccountValue": "30001604788",
      "toAccountValue": "30001605688"
    },
    "SIT": {
      "loginCompanyId": "SPCN08",
      "loginUserId": "SPCN08V01",
      "loginUserIdWithoutApproveOwn": "SPCN08V02",
      "fromAccountValue": "30001593288",
      "toAccountValue": " 5566543333"
    },
    "fromCCY": "USD",
    "toCCY": "SGD",
    "amount": "1000",
    "amountView": "1,000.00",
    "responseCode": "123123",
    "messageToApprover": "messageToApprover",
    "pmtCategory1": "Trade Related - 贸易项下",
    "seriesCode1": "121010 - 一般贸易"
  },
  "FileService": {
    "UAT": {
      "loginCompanyId": "AUTOCN01",
      "loginUserId": "AUTOCN01S01",
      "fileNameForCNAPS": "",
      "fileNameForIBPS": "",
      "fileNameForTT": "",
      "fileNameForCNAPSRemit": "",
      "fileNameForICT01": "",
      "fileNameForTT01": "",
      "fileNameForACT01": "",
      "fileNameForICT02":""
    },
    "SIT": {
      "loginCompanyId": "AUTOCN01",
      "loginUserId": "AUTOCN01S01",
      "fileNameForCNAPS": "",
      "fileNameForIBPS": "",
      "fileNameForTT": "",
      "fileNameForCNAPSRemit": "",
      "fileNameForICT01": "",
      "fileNameForTT01": "",
      "fileNameForACT01": "",
      "fileNameForICT02":""
    },
    "fileType": "ALL",
    "fileFormat": "Universal File Format",
    "approvalOptionTransaction": "By Transaction",
    "approvalOptionFile": "By File",
    "errorMessage": "Invalid currency, please change currency and try again"
  },
  "FixedDeposit": {
    "CNAccount": {
      "UAT": {
        "loginCompanyId": "SPCN08",
        "loginUserId": "SPCN08V01",
        "fundingAccount": "30001591488",
        "fixdDepositAccount": "SUPERCLUBCOLTD-NOTICEACS",
        "challengeResponse": "OK"
      },
      "SIT": {
        "loginCompanyId": "SPCN08",
        "loginUserId": "SPCN08V01",
        "fundingAccount": "300015912",
        "fixdDepositAccount": "SUPERCLUBCOLTD-NOTICEACS",
        "amount": "12,345",
        "challengeResponse": "OK",
        "maturityValue": "Renew Principal Plus Interest",
        "depositType": "Fixed Deposit"
      }
    }
  },
  "Beneficiary": {
    "UAT": {
      "loginCompanyId": "SPCN08",
      "loginUserId": "SPCN08V01"
    },
    "SIT": {
      "loginCompanyId": "SPCN08",
      "loginUserId": "SPCN08V01"
    },
    "Country": "CHINA",
    "newPayeeAdd1": "newPayeeAdd1",
    "newPayeeAdd2": "newPayeeAdd2",
    "newPayeeAdd3": "newPayeeAdd3",
    "newPayeeAcctNumber": "123456000001",
    "newPayeePrintedName": "newPayeePrintedName",
    "cnAccountTransfer": "CN-Account Transfer"
  },
  "template": {
    "UAT": {
      "loginCompanyId": "SPCN08",
      "loginUserId": "SPCN08V01"
    },
    "SIT": {
      "loginCompanyId": "SPCN08",
      "loginUserId": "SPCN08V01"
    },
    "IBPSPayment": {
      "fromAccount": "30001591488",
      "amountA1": "10",
      "Country": "CHINA",
      "newPayeeName": "IBPSNewPayeeNam·e",
      "newPayeeAdd1": "newPayeeAdd1",
      "newPayeeAdd2": "newPayeeAdd2",
      "newPayeeAdd3": "newPayeeAdd3",
      "payeeBankID": "001110002715",
      "newPayeeAcctNumber": "1234567890",
      "paymentDetail": "PaymentDetails"
    },
    "CrossBorder": {
      "fromAccount": "30001593288",
      "paymentCountry": "AFGHANISTAN",
      "debitType": "Itemized Debit",
      "amount": "1",
      "purposePaymentLine": "Purpose Payment Line11",
      "counterPartyCode": "ANDORRA",
      "specPmtPurpose": "预付货款 Advance Payment",
      "pmtCategory1": "Trade Related - 贸易项下",
      "seriesCode1": "121010 - 一般贸易",
      "cnttTransRemark1": "Transaction Remark1111",
      "paymentDetailLine": "Payment Detail Line111",
      "cROATIACtry": "CROATIA",
      "newPayeeName": "newPayeeName",
      "newPayeeAdd1": "newPayeeAdd1",
      "newPayeeAdd2": "newPayeeAdd2",
      "newPayeeAdd3": "newPayeeAdd3",
      "payeeBankId": "ASBZHR20XXX",
      "newPayeeRoutingCode": "1234567",
      "newPayeeAcctNo": "232323",
      "paymentDetail": "Payment details to the payee bank",
      "Email1": "Email1@111.COM",
      "Email2": "Email2@222.COM",
      "Email3": "Email3@333.COM",
      "Email4": "Email4@444.COM",
      "Email5": "Email5@555.COM",
      "Message": "AutoTestMessage",
      "EUR": "EUR"
    }
  },
  "PaymentReport": {
    "UAT": {
      "loginCompanyId": "SPCN08",
      "loginUserId": "SPCN08V01",
      "account": "77788999333 Name - 77788999333 - CNY",
      "accountNotInclude": "30001593286 Name - 30001593286 - USD"
    },
    "SIT": {
      "loginCompanyId": "SPCN08",
      "loginUserId": "SPCN08V01",
      "account": "77788999333 Name - 77788999333 - CNY",
      "accountNotInclude": "30001593286 Name - 30001593286 - USD"
    },
    "usage": "Shared",
    "daily": "Evening (6PM-8PM)",
    "deliverySchedule": "Daily",
    "deliveryOneOff": "One-off / ad-hoc",
    "password": "123456",
    "confirmPassword": "123456",
    "remarks": "remarks",
    "payeeReference": "payeeReference",
    "payeeName": "payeeName"
  },
  "IntraCompanyTransfer": {
    "UAT": {
      "loginCompanyId": "SPCN08",
      "loginUserId": "SPCN08V03",
      "fromAccount1": "2024081601",
      "toAccount1": "2024081602",
      "toAccount2": "30001591488"
    },
    "SIT": {
      "loginCompanyId": "SPCN08",
      "loginUserId": "SPCN08V03",
      "fromAccount1": "2024081601",
      "toAccount1": "2024081602",
      "toAccount2": "30001591488"
    },
    "amountA1": "10",
    "editAmount": "20",
    "additionNote": "messageToOrderingBank",
    "paymentType": "Transfer within Own Accounts"
  }
}